P = [i for i in range(2,101) if all([i%j!=0 for j in range(2, int(i**0.5) + 1)])]
print(P)
print(len(P))

ans = 10**10
for i in range(1<<len(P)):
    S = []
    T = []
    for j in range(len(P)):
        if (i >> j) & 1:
            S.append(P[j])
        else:
            T.append(P[j])
    
    d = abs(sum(S) - sum(T))
    if ans > d:
        ans = d
        SA = S
        SB = T
        print(ans, SA, SB)
        if ans == 0:
            break

# 方針: 
# とりあえず全探索してみる
# 素数1個はSAとSBのどちらかに入るので、2^25 = 3.3*10^7通り
# 0 から 2^25-1 まで回すと、2進数で表した時に00...00から11...11までの01の列が全通り現れるのでそれを利用
# 25桁の2進数の数字を見て(下位から)j桁目(0<=i<=24)が1ならSに入れる、0ならTに入れる

# ただ、2^25通りについて25回ループを回すので、実行時間がちょい厳しいかもしれない…

# と思いつつやってみたら最小値0が見つかったのでそれが見つかったら終了することにした
# 0000001111111101111110111で終わっているので2^19 * 25 = 1.3 * 10^7 で終わってくれた

# 出力
# [2, 3, 5, 7, 11, 13, 17, 19, 23, 29, 31, 37, 41, 43, 47, 53, 59, 61, 67, 71, 73, 79, 83, 89, 97]
# 25
# 1060 [] [2, 3, 5, 7, 11, 13, 17, 19, 23, 29, 31, 37, 41, 43, 47, 53, 59, 61, 67, 71, 73, 79, 83, 89, 97]
# 1056 [2] [3, 5, 7, 11, 13, 17, 19, 23, 29, 31, 37, 41, 43, 47, 53, 59, 61, 67, 71, 73, 79, 83, 89, 97]
# 1054 [3] [2, 5, 7, 11, 13, 17, 19, 23, 29, 31, 37, 41, 43, 47, 53, 59, 61, 67, 71, 73, 79, 83, 89, 97]

# 中略

# 10 [2, 3, 5, 7, 11, 13, 17, 19, 23, 29, 31, 37, 41, 47, 53, 59, 61, 67] [43, 71, 73, 79, 83, 89, 97]
# 6 [2, 3, 5, 7, 11, 13, 17, 19, 23, 29, 31, 37, 43, 47, 53, 59, 61, 67] [41, 71, 73, 79, 83, 89, 97]
# 4 [2, 5, 7, 11, 13, 17, 19, 23, 29, 31, 41, 43, 47, 53, 59, 61, 67] [3, 37, 71, 73, 79, 83, 89, 97]
# 2 [3, 5, 7, 11, 13, 17, 19, 23, 29, 31, 41, 43, 47, 53, 59, 61, 67] [2, 37, 71, 73, 79, 83, 89, 97]
# 0 [2, 3, 5, 11, 13, 17, 19, 23, 29, 37, 41, 43, 47, 53, 59, 61, 67] [7, 31, 71, 73, 79, 83, 89, 97]



# print(sum([2, 3, 5, 11, 13, 17, 19, 23, 29, 37, 41, 43, 47, 53, 59, 61, 67]), sum([7, 31, 71, 73, 79, 83, 89, 97]))
#
# 530 530

print("\n\n")

# どうやら0の解はいっぱいありそう
# おまけ
import random

# 乱択でも十分速く見つかる
while 1:
    i = random.randint(0,(1<<25)-1)
    S = []
    T = []
    for j in range(25):
        if (i >> j) & 1:
            S.append(P[j])
        else:
            T.append(P[j])
    
    if abs(sum(S) - sum(T)) == 0:
        print(S, T)
        break